code-review/NRB_3471_3546/База_Стало/Reports/ОперационныйЖурналРасширенный_Новый.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ОперационныйЖурналРасширенный_Новый</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассОперации</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительКадровойСлужбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаНалоговыеРегистры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УполномоченныйПредставитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписантОтчетовПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контролер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписантСПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенеральныйДиректор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаОсобыхКлиентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписантВРегуляторнойОтчетности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительВРегуляторнойОтчетности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/ОткрытиеСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОткрытиеСчетаДепо</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДепозитарногоДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СлужебноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДепозитарногоДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/ЗакрытиеСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗакрытиеСчетаДепо</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/ОтменаПредставителяСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОтменаПредставителяСчетаДепо</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПредставителиСчетаДепо</xr:Item>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПредставителяСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПредставителейСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/ПогашениеНКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПогашениеНКД</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий250</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Депонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НКД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/ОперационныйЖурналРасширенный_Новый/Ext/ObjectModule.bsl
Функция ФормированиеОписанияПериода()
	Если ДатаНач = '00010101000000' И ДатаКон = '00010101000000' Тогда
		ОписаниеПериода = "Период: без ограничения.";
	Иначе
		Если ДатаНач = '00010101000000' ИЛИ ДатаКон = '00010101000000' Тогда
			ОписаниеПериода = "Период: " + Формат(ДатаНач, "ДФ = ""дд.ММ.гггг""; ДП = ""без ограничения""") 
		Иначе
			ОписаниеПериода = "Период: " + ПредставлениеПериода(НачалоДня(ДатаНач), КонецДня(ДатаКон), "ФП = Истина");
		КонецЕсли;
	КонецЕсли;

	Возврат  ОписаниеПериода;
КонецФункции

Процедура Сформировать(ТабличныйДокумент) Экспорт
	Депозитарий = Константы.ОрганизацияПоУмолчанию.Получить();
	Если Депозитарий.Пустая() Тогда
		Сообщить("Не выбрано значение организации, используемое по умолчанию!!!");
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОперацииДепозитария.Номер,
	|	ОперацииДепозитария.ВидОперации,
	|	ВЫБОР
	|		КОГДА ОперацииДепозитария.ВидОперации.КлассОпераций = ЗНАЧЕНИЕ(Перечисление.КлассыОпераций.Глобальные) И НЕ ОперацииДепозитария.ЦеннаяБумага ЕСТЬ NULL
	|		ТОГДА ОперацииДепозитария.ЦеннаяБумага.Эмитент
	|		ИНАЧЕ ОперацииДепозитария.Инициатор
	|	КОНЕЦ												КАК Инициатор,
	|	ОперацииДепозитария.СчетДепо						КАК СчетДепо,
	|	ОперацииДепозитария.Количество,
	|	ВЫБОР
	|		КОГДА ОперацииДепозитария.Исполнитель ЕСТЬ NULL ИЛИ ОперацииДепозитария.Исполнитель = """" ИЛИ ОперацииДепозитария.Исполнитель <> ""Бушуева Елизавета Владимировна""
	|		ТОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо
	|		ИНАЧЕ ОперацииДепозитария.Исполнитель
	|	КОНЕЦ												КАК Исполнитель,
	|	ОперацииДепозитария.Ссылка							КАК Документ,
	|	ОперацииДепозитария.Контрагент,
	|	ОперацииДепозитария.ЦеннаяБумага,
	|	Договоры.Ссылка										КАК Договор
	|ИЗ
	|	(
	|	ВЫБРАТЬ
	|		ОперацииЦБ.Номер							КАК Номер,
	|		ОперацииЦБ.ВидОперацииД						КАК ВидОперации,
	|		ОперацииЦБ.ДокументОснование.Инициатор		КАК Инициатор,
	|		ОперацииЦБ.СчетДепо							КАК СчетДепо,
	|		ОперацииЦБ.Количество						КАК Количество,
	|		ОперацииЦБ.Автор.ФизЛицо					КАК Исполнитель,
	|		ОперацииЦБ.Ссылка							КАК Ссылка,
	|		ОперацииЦБ.Получатель						КАК Контрагент,
	|		ОперацииЦБ.ЦБ								КАК ЦеннаяБумага
	|	ИЗ
	|		Документ.ОперацииЦБ КАК ОперацииЦБ
	|	ГДЕ
	|		ОперацииЦБ.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И
	|		ОперацииЦБ.ПометкаУдаления = ЛОЖЬ
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		ОткрытиеСчетаДепо.Номер,
	|		ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ОткрытиеСчетаДепо),
	|		ОткрытиеСчетаДепо.ДокументОснование.Инициатор,
	|		ОткрытиеСчетаДепо.СчетДепо,
	|		NULL,
	|		ОткрытиеСчетаДепо.Автор.ФизЛицо,
	|		ОткрытиеСчетаДепо.Ссылка,
	|		NULL,
	|		ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка)
	|	ИЗ
	|		Документ.ОткрытиеСчетаДепо КАК ОткрытиеСчетаДепо
	|	ГДЕ
	|		ОткрытиеСчетаДепо.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И
	|		ОткрытиеСчетаДепо.ПометкаУдаления = ЛОЖЬ
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		ОткрытиеРазделаСчетаДепо.Номер,
	|		ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ОткрытиеРазделаСчетаДепо),
	|		ОткрытиеРазделаСчетаДепо.ДокументОснование.Инициатор,
	|		ОткрытиеРазделаСчетаДепо.СчетДепо,
	|		NULL,
	|		ОткрытиеРазделаСчетаДепо.Автор.ФизЛицо,
	|		ОткрытиеРазделаСчетаДепо.Ссылка,
	|		NULL,
	|		ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка)
	|	ИЗ
	|		Документ.ОткрытиеРазделаСчетаДепо КАК ОткрытиеРазделаСчетаДепо
	|	ГДЕ
	|		ОткрытиеРазделаСчетаДепо.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И
	|		ОткрытиеРазделаСчетаДепо.ПометкаУдаления = ЛОЖЬ
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		ЗакрытиеСчетаДепо.Номер,
	|		ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ЗакрытиеСчетаДепо),
	|		ЗакрытиеСчетаДепо.ДокументОснование.Инициатор,
	|		ЗакрытиеСчетаДепо.СчетДепо,
	|		NULL,
	|		ЗакрытиеСчетаДепо.Автор.ФизЛицо,
	|		ЗакрытиеСчетаДепо.Ссылка,
	|		NULL,
	|		ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка)
	|	ИЗ
	|		Документ.ЗакрытиеСчетаДепо КАК ЗакрытиеСчетаДепо
	|	ГДЕ
	|		ЗакрытиеСчетаДепо.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И
	|		ЗакрытиеСчетаДепо.ПометкаУдаления = ЛОЖЬ
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		НазначениеПредставителяСчетаДепо.Номер,
	|		НазначениеПредставителяСчетаДепо.ДокументОснование.ВидОперацииД,
	|		НазначениеПредставителяСчетаДепо.ДокументОснование.Инициатор,
	|		НазначениеПредставителяСчетаДепо.СчетДепо,
	|		NULL,
	|		НазначениеПредставителяСчетаДепо.Автор.ФизЛицо,
	|		НазначениеПредставителяСчетаДепо.Ссылка,
	|		NULL,
	|		ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка)
	|	ИЗ
	|		Документ.НазначениеПредставителяСчетаДепо КАК НазначениеПредставителяСчетаДепо
	|	ГДЕ
	|		НазначениеПредставителяСчетаДепо.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|		И НазначениеПредставителяСчетаДепо.ПометкаУдаления = ЛОЖЬ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОтменаПредставителяСчетаДепо.Номер,
	|		ОтменаПредставителяСчетаДепо.ДокументОснование.ВидОперацииД,
	|		ОтменаПредставителяСчетаДепо.ДокументОснование.Инициатор,
	|		ОтменаПредставителяСчетаДепо.СчетДепо,
	|		NULL,
	|		ОтменаПредставителяСчетаДепо.Автор.ФизЛицо,
	|		ОтменаПредставителяСчетаДепо.Ссылка,
	|		NULL,
	|		ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка)
	|	ИЗ
	|		Документ.ОтменаПредставителяСчетаДепо КАК ОтменаПредставителяСчетаДепо
	|	ГДЕ
	|		ОтменаПредставителяСчетаДепо.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|		И ОтменаПредставителяСчетаДепо.ПометкаУдаления = ЛОЖЬ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПогашениеЦБ.Номер,
	|		ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Погашение),
	|		ПогашениеЦБ.Инициатор,
	|		NULL,
	|		NULL,
	|		ПогашениеЦБ.Автор.ФизЛицо,
	|		ПогашениеЦБ.Ссылка,
	|		NULL,
	|		ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка)
	|	ИЗ
	|		Документ.ПогашениеЦБ КАК ПогашениеЦБ
	|	ГДЕ
	|		ПогашениеЦБ.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|		И ПогашениеЦБ.ПометкаУдаления = ЛОЖЬ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КонвертацияЦБ.Номер,
	|		ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Конвертация),
	|		КонвертацияЦБ.Инициатор,
	|		NULL,
	|		NULL,
	|		КонвертацияЦБ.Автор.ФизЛицо,
	|		КонвертацияЦБ.Ссылка,
	|		NULL,
	|		ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка)
	|	ИЗ
	|		Документ.КонвертацияЦБ КАК КонвертацияЦБ
	|	ГДЕ
	|		КонвертацияЦБ.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|		И КонвертацияЦБ.ПометкаУдаления = ЛОЖЬ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		Номер,
	|		ДокументОснование.ВидОперацииД,
	|		ДокументОснование.Инициатор,
	|		СчетДепо,
	|		NULL,
	|		Автор.ФизЛицо,
	|		Ссылка,
	|		ВладелецСчета,
	|		NULL
	|	ИЗ
	|		Документ.Выписка
	|	ГДЕ
	|		Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И
	|		ПометкаУдаления = ЛОЖЬ
	|	И
	|		ДокументОснование.ВидОперацииД ССЫЛКА Перечисление.ВидыОтчетов 
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВводДивидендов.Ссылка.Номер,
	|		ЗНАЧЕНИЕ(Справочник.ВидыОпераций.НачислениеДивидендов),
	|		ВводДивидендов.Ссылка.ЦеннаяБумага.Эмитент,
	|		СчетаДепо.Ссылка,
	|		ВводДивидендов.Количество,
	|		ВводДивидендов.Ссылка.Автор.ФизЛицо,
	|		ВводДивидендов.Ссылка,
	|		NULL,
	|		ВводДивидендов.Ссылка.ЦеннаяБумага
	|	ИЗ
	|		Документ.ВводДивидендов.ТаблицаДивиденды КАК ВводДивидендов
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				МИНИМУМ(СчетаДепо.Ссылка) КАК Ссылка,
	|				СчетаДепо.Владелец КАК Владелец
	|			ИЗ
	|				Справочник.СчетаДепо КАК СчетаДепо
	|			СГРУППИРОВАТЬ ПО
	|				СчетаДепо.Владелец) КАК СчетаДепо
	|			ПО ВводДивидендов.Депонент = СчетаДепо.Владелец
	|	ГДЕ
	|		ВводДивидендов.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|		И ВводДивидендов.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПогашениеНКД.Ссылка.Номер,
	|		ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ПогашениеНКД),
	|		ПогашениеНКД.Ссылка.ДокументОснование.Инициатор,
	|		ПогашениеНКД.СчетДепо,
	|		ПогашениеНКД.Количество,
	|		ПогашениеНКД.Ссылка.Автор.ФизЛицо,
	|		ПогашениеНКД.Ссылка,
	|		ПогашениеНКД.ЦеннаяБумага.Эмитент,
	|		ПогашениеНКД.ЦеннаяБумага
	|	ИЗ
	|		Документ.ПогашениеНКД.ЦенныеБумаги КАК ПогашениеНКД
	|	ГДЕ
	|		ПогашениеНКД.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|		И ПогашениеНКД.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГлобальнаяОперация.Ссылка.Номер,
	|		ГлобальнаяОперация.Ссылка.ВидГлобальнойОперации,
	|		ГлобальнаяОперация.Ссылка.Инициатор,
	|		ГлобальнаяОперация.Ссылка.СчетДепо,
	|		ГлобальнаяОперация.Количество,
	|		ГлобальнаяОперация.Ссылка.Автор.ФизЛицо,
	|		ГлобальнаяОперация.Ссылка,
	|		ГлобальнаяОперация.ЦеннаяБумага.Эмитент,
	|		ГлобальнаяОперация.ЦеннаяБумага
	|	ИЗ
	|		Документ.ГлобальнаяОперация.ЦенныеБумаги КАК ГлобальнаяОперация
	|	ГДЕ
	|		ГлобальнаяОперация.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|		И ГлобальнаяОперация.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОтменаПоручения.Номер,
	|		ОтменаПоручения.ДокументОснование.ВидОперацииД,
	|		ОтменаПоручения.ДокументОснование.Инициатор,
	|		NULL,
	|		NULL,
	|		ОтменаПоручения.Автор.ФизЛицо,
	|		ОтменаПоручения.Ссылка,
	|		NULL,
	|		ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка)
	|	ИЗ
	|		Документ.ОтменаПоручения КАК ОтменаПоручения
	|	ГДЕ
	|		ОтменаПоручения.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|		И ОтменаПоручения.ПометкаУдаления = ЛОЖЬ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеквизитовСчетаДепо.Номер,
	|		КорректировкаРеквизитовСчетаДепо.ДокументОснование.ВидОперацииД,
	|		КорректировкаРеквизитовСчетаДепо.ДокументОснование.Инициатор,
	|		NULL,
	|		NULL,
	|		КорректировкаРеквизитовСчетаДепо.Автор.ФизЛицо,
	|		КорректировкаРеквизитовСчетаДепо.Ссылка,
	|		NULL,
	|		ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка)
	|	ИЗ
	|		Документ.КорректировкаРеквизитовСчетаДепо КАК КорректировкаРеквизитовСчетаДепо
	|	ГДЕ
	|		КорректировкаРеквизитовСчетаДепо.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|		И КорректировкаРеквизитовСчетаДепо.ПометкаУдаления = ЛОЖЬ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ФормированиеРеестраВладельцев.Номер,
	|		ФормированиеРеестраВладельцев.ДокументОснование.ВидОперацииД,
	|		ФормированиеРеестраВладельцев.ДокументОснование.Инициатор,
	|		NULL,
	|		NULL,
	|		ФормированиеРеестраВладельцев.Автор.ФизЛицо,
	|		ФормированиеРеестраВладельцев.Ссылка,
	|		NULL,
	|		ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка)
	|	ИЗ
	|		Документ.ФормированиеРеестраВладельцев КАК ФормированиеРеестраВладельцев
	|	ГДЕ
	|		ФормированиеРеестраВладельцев.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|		И ФормированиеРеестраВладельцев.ПометкаУдаления = ЛОЖЬ) КАК ОперацииДепозитария
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(, ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.УполномоченныйПредставитель)) КАК ОтветственныеЛицаОрганизацийСрезПоследних
	|	ПО (ИСТИНА)
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.ДоговорыКонтрагентов КАК Договоры
	|	ПО Договоры.Владелец = ОперацииДепозитария.СчетДепо.Владелец И Не ОперацииДепозитария.СчетДепо ЕСТЬ NULL И (Договоры.ДатаОкончанияДействия = ДАТАВРЕМЯ(1,1,1) ИЛИ Договоры.ДатаОкончанияДействия >= ОперацииДепозитария.Ссылка.Дата)";

	ДопУсловие	= "";

	// Доп. условие по виду операции
	Если ВидОперации.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
		ДопУсловие = ДопУсловие  + "
		|	ОперацииДепозитария.ВидОперации В (&ВидОперации)";
	КонецЕсли;

	// Доп. условие по классу операции
	Если КлассОперации.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("КлассОперации", КлассОперации);
		ДопУсловие = ДопУсловие + "
		|" + ?(СтрДлина(ДопУсловие) > 0, "И " , "") + "
		|	(ВЫБОР
		|		КОГДА ОперацииДепозитария.ВидОперации ССЫЛКА Перечисление.ВидыОтчетов ТОГДА ЗНАЧЕНИЕ(Перечисление.КлассыОпераций.Информационные)
		|	   	ИНАЧЕ ОперацииДепозитария.ВидОперации.КлассОпераций
		|	КОНЕЦ) В (&КлассОперации)";
	КонецЕсли;

	// Доп. условие по счету Депо
	Если СчетДепо.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("СчетДепо", СчетДепо);
		ДопУсловие = ДопУсловие + "
		|" + ?(СтрДлина(ДопУсловие) > 0, "И " , "") + "
		|	ОперацииДепозитария.СчетДепо В (&СчетДепо)";
	КонецЕсли;

	// Доп. условие по ценной бумаге
	Если ЦеннаяБумага.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);

		ДопУсловие = ДопУсловие + "
		|" + ?(СтрДлина(ДопУсловие) > 0, "И " , "") + "
		|	ОперацииДепозитария.ЦеннаяБумага В (&ЦеннаяБумага)";
	КонецЕсли;

	// Доп. условие по Инициатору
	Если Инициатор.Количество()>0 Тогда
		Запрос.УстановитьПараметр("Инициатор", Инициатор);
		//---
		ДопУсловие = ДопУсловие + "
		|" + ?(СтрДлина(ДопУсловие) > 0, "И " , "") + "
		|	(ВЫБОР
		|		КОГДА ОперацииДепозитария.ВидОперации.КлассОпераций = ЗНАЧЕНИЕ(Перечисление.КлассыОпераций.Глобальные) И НЕ ОперацииДепозитария.ЦеннаяБумага ЕСТЬ NULL
		|		ТОГДА ОперацииДепозитария.ЦеннаяБумага.Эмитент
		|		ИНАЧЕ ОперацииДепозитария.Инициатор
		|	 КОНЕЦ) В (&Инициатор)";
	КонецЕсли;

	// Доп. условие по Контрагенту
	Если Контрагент.Количество() > 0 Тогда	
		Запрос.УстановитьПараметр("Контрагент", Контрагент);

		ДопУсловие = ДопУсловие + "
		|" + ?(СтрДлина(ДопУсловие) > 0, "И " , "") + "
		|	ОперацииДепозитария.Контрагент В (&Контрагент)";
	КонецЕсли;

	// Доп. условие по исполнителю
	Если Исполнитель.Количество() > 0 Тогда	
		Запрос.УстановитьПараметр("Исполнитель", Исполнитель);

		ДопУсловие = ДопУсловие + "
		|" + ?(СтрДлина(ДопУсловие) > 0, "И " , "") + "
		|	ВЫБОР
		|		КОГДА ОперацииДепозитария.Исполнитель ЕСТЬ NULL ИЛИ ОперацииДепозитария.Исполнитель = """" ИЛИ ОперацииДепозитария.Исполнитель <> ""Бушуева Елизавета Владимировна""
		|		ТОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо
		|		ИНАЧЕ ОперацииДепозитария.Исполнитель
		|	КОНЕЦ В (&Исполнитель)";
	КонецЕсли;

	// Вставим сформированные условия в запрос
	Если СтрДлина(ДопУсловие) > 0 Тогда
		Запрос.Текст = Запрос.Текст + "
		|ГДЕ
		|" + ДопУсловие;
	КонецЕсли;

	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО
	|	ОперацииДепозитария.Ссылка.Дата
	|ИТОГИ
	|ПО
	|	СчетДепо";

	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Сообщить("Нет данных для вывода в отчет!");
		Возврат;
	КонецЕсли;

	Таблица	= ТабличныйДокумент;

	Макет			= ПолучитьМакет("ОперационныйЖурнал");
	ОбластьЗаголовок= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка	= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвал	= Макет.ПолучитьОбласть("Подвал");

	ОбластьЗаголовок.Параметры.Организация		= Депозитарий.НаименованиеПолное;
	ДанныеЛицензии								= ФормированиеПечатныхФорм.ДанныеЛицензииОрганизации(Депозитарий);	 
	ОбластьЗаголовок.Параметры.ЛицензияНомер	= "Лицензия № " + ДанныеЛицензии.НомерЛицензии + " от ";
	ОбластьЗаголовок.Параметры.ЛицензияДата		= ДанныеЛицензии.ДатаЛицензии + " г. ";
	ОбластьЗаголовок.Параметры.ОписаниеПериода	= ФормированиеОписанияПериода();

	Таблица.Вывести(ОбластьЗаголовок);
	Таблица.Вывести(ОбластьШапка);

	Таблица.НачатьАвтогруппировкуСтрок();

	ОбластьГруппа	= Макет.ПолучитьОбласть("ГруппаСчетДепо");
	ОбластьДетали	= Макет.ПолучитьОбласть("Детали");

	СчСтрок = 0;

	ВыборкаСчета	= Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСчета.Следующий() Цикл

		СчетДепоО			= ВыборкаСчета.СчетДепо;
		СчетДепоВладелец	= ?(ЗначениеЗаполнено(СчетДепоО), СчетДепоО.Владелец, "");

		ОбластьГруппа.Параметры.СчетДепо	= СчетДепоО;
		ОбластьГруппа.Параметры.Наименование= СчетДепоВладелец;

		Таблица.Вывести(ОбластьГруппа, ВыборкаСчета.Уровень());

		ВыборкаДетали	= ВыборкаСчета.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			СчСтрок = СчСтрок + 1;

			ОбластьДетали.Параметры.Документ			= ВыборкаДетали.Документ;

			ОбластьДетали.Параметры.СчСтрок				= СчСтрок;
			ОбластьДетали.Параметры.Номер				= ВыборкаДетали.Номер;
			ОбластьДетали.Параметры.ВидОперации			= ВыборкаДетали.ВидОперации;
			ОбластьДетали.Параметры.КлассОпераций		= ?(Не ТипЗнч(ВыборкаДетали.ВидОперации) = Тип("ПеречислениеСсылка.ВидыОтчетов"), ВыборкаДетали.ВидОперации.КлассОпераций, "Информационные");
			ОбластьДетали.Параметры.ОснованиеОперации	= ВыборкаДетали.Документ.ДокументОснование;

			Если ВыборкаДетали.ВидОперации = Справочники.ВидыОпераций.Блокирование Тогда
			    ОбластьДетали.Параметры.Содержание	= ВыборкаДетали.Документ.ДокументОснование.Комментарий;
			ИначеЕсли ВыборкаДетали.ВидОперации = Справочники.ВидыОпераций.ОткрытиеСчетаДепо ИЛИ ВыборкаДетали.ВидОперации = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо Тогда
				ОбластьДетали.Параметры.Содержание	= "Депозитарный договор №" + ВыборкаДетали.Договор.Код + " от " + ВыборкаДетали.Договор.ДатаНачалоДействия;
			ИначеЕсли ВыборкаДетали.ВидОперации = Справочники.ВидыОпераций.НазначениеОператораСчетаДепо Тогда
				ОбластьДетали.Параметры.Содержание	= "Договор обслуживания на финансовых рынках №" + ВыборкаДетали.Договор.Код + " от " + ВыборкаДетали.Договор.ДатаНачалоДействия;
			ИначеЕсли ВыборкаДетали.ВидОперации = Справочники.ВидыОпераций.ОтменаПоручения Тогда
				ОбластьДетали.Параметры.Содержание	= ВыборкаДетали.Документ.ОтменяемоеПоручение;
			ИначеЕсли ТипЗнч(ВыборкаДетали.ВидОперации) = Тип("ПеречислениеСсылка.ВидыОтчетов") Тогда
				ОбластьДетали.Параметры.Содержание	= "Поручение на информационную операцию";
			ИначеЕсли ВыборкаДетали.ВидОперации.КлассОпераций = Перечисления.КлассыОпераций.Информационные Тогда
				ОбластьДетали.Параметры.Содержание	= "Поручение на информационную операцию";
			Иначе
				Если ТипЗнч(ОбластьДетали.Параметры.ОснованиеОперации) = Тип("ДокументСсылка.иц_СводноеПоручение") Тогда
			        ОбластьДетали.Параметры.Содержание	= "Сделки по Договору обслуживания на финансовых рынках";
				Иначе
					ОбластьДетали.Параметры.Содержание	= ОбластьДетали.Параметры.ОснованиеОперации.Комментарий;
				КонецЕсли;
			КонецЕсли;

			ОбластьДетали.Параметры.Инициатор	= ВыборкаДетали.Инициатор;

			ОбластьДетали.Параметры.СчетДепо			= СчетДепоО;
			ОбластьДетали.Параметры.СчетДепоНаименование= СчетДепоВладелец;
			// Заполним описание ЦБ
			Если ЗначениеЗаполнено(ВыборкаДетали.ЦеннаяБумага) Тогда
				Эмитент	= СокрЛП(ВыборкаДетали.ЦеннаяБумага.Эмитент.Наименование);
				Серия	= СокрЛП(ВыборкаДетали.ЦеннаяБумага.СерияРегистрации);
				Номер	= СокрЛП(ВыборкаДетали.ЦеннаяБумага.НомерРегистрации);
				ISIN	= СокрЛП(ВыборкаДетали.ЦеннаяБумага.ISIN);

				ОписаниеЦБ	= Эмитент + ?(Серия = "", "", ", " + Серия)
								+ ?(Номер = "", "", " - " + Номер)
								+ ?(ISIN = ""	, "", ", " + ISIN);

				ОбластьДетали.Параметры.ЦБОписание		= ОписаниеЦБ;
			Иначе			
				ОбластьДетали.Параметры.ЦБОписание		= "";
			КонецЕсли;
			ОбластьДетали.Параметры.Количество			= ВыборкаДетали.Количество;
			ОбластьДетали.Параметры.НачалоОперации		= ВыборкаДетали.Документ.ДокументОснование.Дата;
			ОбластьДетали.Параметры.ОкончаниеОперации	= ВыборкаДетали.Документ.Дата;
			ОбластьДетали.Параметры.Контрагент			= ВыборкаДетали.Контрагент;
			ОбластьДетали.Параметры.Исполнитель			= ВыборкаДетали.Исполнитель;

			Таблица.Вывести(ОбластьДетали, ВыборкаДетали.Уровень());
		КонецЦикла;
	КонецЦикла;

	Таблица.ЗакончитьАвтогруппировкуСтрок();
	Таблица.Вывести(ОбластьПодвал);

	Таблица.ОтображатьСетку			= Ложь;
	Таблица.АвтоМасштаб				= Истина;
	Таблица.ТолькоПросмотр			= Истина;
	Таблица.ОтображатьЗаголовки		= Ложь;
	Таблица.ОриентацияСтраницы		= ОриентацияСтраницы.Ландшафт;
	Таблица.ПовторятьПриПечатиСтроки= Таблица.Область("R17:R19");
КонецПроцедуры	

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
